PhyResearch/Adafruit_nRF52_Arduino/boards.txt
menu.softdevice=SoftDevice
menu.debug=Debug
menu.debug_output=Debug Output

# -----------------------------------
#  fascvia v2 based on Adafruit Feather nRF52840 express
# -----------------------------------
fv2_feather52480_express.name=Fascia Express

fv2_feather52480_express.vid.0=0x63C2
fv2_feather52480_express.pid.0=0x0022
fv2_feather52480_express.vid.1=0x63C2
fv2_feather52480_express.pid.1=0xb022

# Upload
fv2_feather52480_express.bootloader.tool=bootburn
fv2_feather52480_express.upload.tool=nrfutil
fv2_feather52480_express.upload.protocol=nrfutil
fv2_feather52480_express.upload.use_1200bps_touch=true
fv2_feather52480_express.upload.wait_for_upload_port=true
fv2_feather52480_express.upload.maximum_size=815104
fv2_feather52480_express.upload.maximum_data_size=237568

# Build
fv2_feather52480_express.build.mcu=cortex-m4
fv2_feather52480_express.build.f_cpu=64000000
fv2_feather52480_express.build.board=FASCIA_FEATHER_EXPRESS
fv2_feather52480_express.build.core=nRF5
fv2_feather52480_express.build.variant=fv2_feather52480_express
fv2_feather52480_express.build.usb_manufacturer="Fascia"
fv2_feather52480_express.build.usb_product="Fasciav2_xprs"
fv2_feather52480_express.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
fv2_feather52480_express.build.ldscript=nrf52840_s140_v6.ld
fv2_feather52480_express.build.vid=0x63C2
fv2_feather52480_express.build.pid=0x0022

# SoftDevice Menu
fv2_feather52480_express.menu.softdevice.s140v6=S140 6.1.1
fv2_feather52480_express.menu.softdevice.s140v6.build.sd_name=s140
fv2_feather52480_express.menu.softdevice.s140v6.build.sd_version=6.1.1
fv2_feather52480_express.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
fv2_feather52480_express.menu.debug.l0=Level 0 (Release)
fv2_feather52480_express.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
fv2_feather52480_express.menu.debug.l1=Level 1 (Error Message)
fv2_feather52480_express.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
fv2_feather52480_express.menu.debug.l2=Level 2 (Full Debug)
fv2_feather52480_express.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
fv2_feather52480_express.menu.debug.l3=Level 3 (Segger SystemView)
fv2_feather52480_express.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
fv2_feather52480_express.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Debug Output Menu
fv2_feather52480_express.menu.debug_output.serial=Serial
fv2_feather52480_express.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
fv2_feather52480_express.menu.debug_output.serial1=Serial1
fv2_feather52480_express.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
fv2_feather52480_express.menu.debug_output.rtt=Segger RTT
fv2_feather52480_express.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL


# -----------------------------------
# Fascia Particle Xenon
# -----------------------------------

fv2_particle_xenon.name=Fascia Xenon

# VID/PID for Bootloader, Arduino & CircuitPython
fv2_particle_xenon.vid.0=0x63C2
fv2_particle_xenon.pid.0=0x0022
fv2_particle_xenon.vid.1=0x63C2
fv2_particle_xenon.pid.1=0xb022

# Upload
fv2_particle_xenon.bootloader.tool=bootburn
fv2_particle_xenon.upload.tool=nrfutil
fv2_particle_xenon.upload.protocol=nrfutil
fv2_particle_xenon.upload.use_1200bps_touch=true
fv2_particle_xenon.upload.wait_for_upload_port=true
fv2_particle_xenon.upload.maximum_size=815104
fv2_particle_xenon.upload.maximum_data_size=237568

# Build
fv2_particle_xenon.build.mcu=cortex-m4
fv2_particle_xenon.build.f_cpu=64000000
fv2_particle_xenon.build.board=FASCIA_PARTICLE_XENON
fv2_particle_xenon.build.core=nRF5
fv2_particle_xenon.build.variant=fv2_particle_xenon
fv2_particle_xenon.build.usb_manufacturer="Particle"
fv2_particle_xenon.build.usb_product="Xenon"
fv2_particle_xenon.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
fv2_particle_xenon.build.ldscript=nrf52840_s140_v6.ld
fv2_particle_xenon.build.vid=0x63C2
fv2_particle_xenon.build.pid=0x0022

# SoftDevice Menu
fv2_particle_xenon.menu.softdevice.s140v6=S140 6.1.1
fv2_particle_xenon.menu.softdevice.s140v6.build.sd_name=s140
fv2_particle_xenon.menu.softdevice.s140v6.build.sd_version=6.1.1
fv2_particle_xenon.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
fv2_particle_xenon.menu.debug.l0=Level 0 (Release)
fv2_particle_xenon.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
fv2_particle_xenon.menu.debug.l1=Level 1 (Error Message)
fv2_particle_xenon.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
fv2_particle_xenon.menu.debug.l2=Level 2 (Full Debug)
fv2_particle_xenon.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
fv2_particle_xenon.menu.debug.l3=Level 3 (Segger SystemView)
fv2_particle_xenon.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
fv2_particle_xenon.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Debug Output Menu
fv2_particle_xenon.menu.debug_output.serial=Serial
fv2_particle_xenon.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
fv2_particle_xenon.menu.debug_output.serial1=Serial1
fv2_particle_xenon.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
fv2_particle_xenon.menu.debug_output.rtt=Segger RTT
fv2_particle_xenon.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# -----------------------------------
# Adafruit Feather nRF52832
# -----------------------------------
feather52832.name=Adafruit Feather nRF52832

# VID/PID for Bootloader, Arduino & CircuitPython

# Upload
feather52832.bootloader.tool=bootburn
feather52832.upload.tool=nrfutil
feather52832.upload.protocol=nrfutil
feather52832.upload.use_1200bps_touch=false
feather52832.upload.wait_for_upload_port=false
feather52832.upload.native_usb=false
feather52832.upload.maximum_size=290816
feather52832.upload.maximum_data_size=52224

# Build
feather52832.build.mcu=cortex-m4
feather52832.build.f_cpu=64000000
feather52832.build.board=NRF52832_FEATHER
feather52832.build.core=nRF5
feather52832.build.variant=feather_nrf52832
feather52832.build.usb_manufacturer="Adafruit"
feather52832.build.usb_product="Feather nRF52832"
feather52832.build.extra_flags=-DNRF52832_XXAA -DNRF52
feather52832.build.ldscript=nrf52832_s132_v6.ld

